print("2021년, 상명대학교의 F4 마음을 훔쳐라!")
print("당신의 연애를 지금 당장 시작해보세요!\n대답에는 '응' 또는 '아니'가 포함되어야 합니다!\n")
print("귀엽고 순수한 스타일, 변백현\n")
name=input("당신의 이름을 입력하세요:")


answer1=input("변백현:" + name + " 안녕? 반가워! 혹시 오늘 시간 있어?\n")

if '아니' in answer1:
    answer5=input("변백현: 그렇구나... 다른 날도 안 되는 걸까?\n")
    if '응' in answer5:
        print("변백현: 알았어! 그럼 그냥 나중에 학교에서 보자!\n")
        print("변백현님이 당신을 향한 마음을 포기했습니다.\n")
        
    else:
        print("변백현: 그래? 그럼 되는 날 연락 줘! 기다리고 있을게!\n")
        print("변백현님의 당신을 향한 호감지수가 상승중입니다.")
        
else:
    answer2=input("변백현: 그럼 나랑 영화 보러 갈래?\n")

    if '아니' in answer2:
        print("변백현:아.. 알겠어..그럼 나중에 시간 되면 보러가자!\n")
        print("변백현님의 당신을 향한 호감지수가 하락중입니다.")

    else:
        answer3=input("변백현: 대박! 아껴둔 영화 할인 쿠폰이 있었는데 너랑 보러 가려고 안 쓰고 있었거든..그럼 오늘 7시까지 롯데시네마로 나와! 기다리고 있을게!\n")

        if '아니' in answer3:
            print("변백현:아.. 알겠어..그럼 나중에 시간 되면 보러가자!\n")
            print("변백현님의 당신을 향한 호감지수가 하락중입니다.")

        else:
            answer4=input("변백현: 팝콘은 좋아해? 내가 살게!\n")

            if '아니' in answer4:
                print("변백현:아.. 알겠어..그럼 나중에 시간 되면 보러가자!\n")
                print("변백현님의 당신을 향한 호감지수가 하락중입니다.")
            
            else:
                print("변백현:", name, "너가 너무 좋아!\n")
                print("변백현님의 당신을 향한 호감지수가 급상승했습니다!")

print()
print("--------------------------------------------------------------------------------")
print()


print("2021년, 상명대학교의 F4 마음을 훔쳐라!")
print("당신의 연애를 지금 당장 시작해보세요!\n대답에는 '응' 또는 '아니'가 포함되어야 합니다!\n")
print("시크한 차도남 스타일, 강동원\n")
name2=input("당신의 이름을 입력하세요:")


answer5=input("강동원: 어이" +name2+ "안녕? 반갑다? 혹시 내 과제 좀 대신 해줄래?\n")


if '아니' in answer5:
    answer6=input("강동원: 내 말을 거역한 여자는 너가 처음이야. 혹시 오늘 시간 되냐?\n")
    if '응' in answer6:
        print("강동원: 그래 그럼 이따 연락해라\n")
        print("강동원님의 당신을 향한 호감지수가 상승중입니다.\n")
        
    else:
        print("강동원: 알겠다\n")
        print("강동원님이 당신을 향한 마음을 포기했습니다.")
        
else:
    answer7=input("강동원: 풉, 되게 단순하잖아? 과제는 됐고 나랑 영화나 보자\n")
    
    if '아니' in answer7:
        print("강동원: 나 매달리는 남자 아니다? 나중에 뭐 시간 되면 보러가던가 해\n")
        print("강동원님의 당신을 향한 호감지수가 하락중입니다.")

    else:
        answer8=input("강동원: 영화표 두 장 있는데 오다 주웠으니까 이따 7시까지 롯데시네마로 나와라\n")
        
        if '아니' in answer8:
            print("강동원: 나 매달리는 남자 아니다? 나중에 뭐 시간 되면 보러가던가 해\n")
            print("강동원님의 당신을 향한 호감지수가 하락중입니다.")
            
        else:
            answer9=input("강동원: 팝콘은 좋아하냐? 내가 사던가 하지 뭐\n")
            
            if '아니' in answer9:
                print("강동원: 나 매달리는 남자 아니다? 나중에 뭐 시간 되면 보러가던가 해\n")
                print("강동원님의 당신을 향한 호감지수가 하락중입니다.")

            else:
                print("강동원:", name2, "나... 너 좋아하냐?\n")
                print("강동원님의 당신을 향한 호감지수가 급상승했습니다!")
    
print()
print("--------------------------------------------------------------------------------")
print()


print("2021년, 상명대학교의 F4 마음을 훔쳐라!")
print("당신의 연애를 지금 당장 시작해보세요!\n대답에는 '응' 또는 '아니'가 포함되어야 합니다!\n")
print("반듯한 모범생 스타일, 차은우\n")
name3=input("당신의 이름을 입력하세요:")


answer10=input("차은우:" + name3 + "오늘 수업 끝나고 시간 있어??\n")

if '아니' in answer10:
    answer11=input("차은우: 같이 판례 분석하고 싶었는데 내일도 시간 없어?\n")
    if '응' in answer11:
        print("차은우: ..알겠어 그럼\n")
        print("차은우님이 당신을 향한 마음을 포기했습니다.\n")
        
    else:
        print("차은우: 그럼 내가 내일 연락할게! 내일 보자\n")
        print("차은우님의 당신을 향한 호감지수가 상승중입니다.")

else:
    answer12=input("차은우: 그래? 그럼 나랑 같이 판례 분석할래?\n")
    
    if '아니' in answer12:
        print("차은우: 알았어. 다음에 시간 맞으면 그때 같이 하자\n")
        print("차은우님의 당신을 향한 호감지수가 하락중입니다.")

    else:
        answer13=input("차은우: 아까 보니까 리라에 자리 많던데 우리 리라에서 하자!\n")
        
        if '아니' in answer13:
            print("차은우: 알았어. 다음에 시간 맞으면 그때 같이 하자\n")
            print("차은우님의 당신을 향한 호감지수가 하락중입니다.")
            
        else:
            answer14=input("차은우: 배는 안고파? 수업 끝나고 밥 먹은 다음에 분석할까?\n")
            
            if '아니' in answer14:
                print("차은우: 알았어. 다음에 시간 맞으면 그때 같이 하자\n")
                print("차은우님의 당신을 향한 호감지수가 하락중입니다.")
            else:
                print("차은우:", name3, "...우리 만나볼래? 나 가벼운 남자 아니야\n")
                print("차은우님의 당신을 향한 호감지수가 급상승했습니다!")

print()
print("--------------------------------------------------------------------------------")
print()


print("2021년, 상명대학교의 F4 마음을 훔쳐라!")
print("당신의 연애를 지금 당장 시작해보세요!\n대답에는 '응' 또는 '아니'가 포함되어야 합니다!\n")
print("활발한 장난꾸러기 스타일, 김태형\n")
name4=input("당신의 이름을 입력하세요:")


answer15=input("김태형: 야 " +name4+ " 하이~ 오늘 시간 있냐?\n")

if '아니' in answer15:
    answer16=input("김태형: 그럼 내일은? 내일은 시간 돼??\n")
    if '응' in answer16:
        print("김태형: 오예 그럼 내일 나랑 롯데월드 가기다? 요즘 놀이기구 엄청 타고 싶었거든!\n")
        print("김태형님의 당신을 향한 호감지수가 상승중입니다.\n")
        
    else:
        print("김태형: 힝 알겠오..다음에 보자\n")
        print("김태형님이 당신을 향한 마음을 포기했습니다.")
    
else:
    answer17=input("김태형: 요즘 놀이기구 타고 싶지? 난 엄청 타고 싶은데! 오늘 나랑 롯데월드 갈래??\n")
    
    if '아니' in answer17:
        print("김태형: 놀이공원은 별로야..? 그럼 다른 곳 갈까? 혹시 나랑 노는 게 싫은 건 아니지?!\n")
        print("김태형님의 당신을 향한 호감지수가 하락중입니다.")

    else:
        answer18=input("김태형: 그럼 5시까지 롯데월드 매표소 앞에서 만나자\n")
        
        if '아니' in answer18:
            print("김태형: 놀이공원은 별로야..? 그럼 다른 곳 갈까? 혹시 나랑 노는 게 싫은 건 아니지?!\n")
            print("김태형님의 당신을 향한 호감지수가 하락중입니다.")

        else:
            answer19=input("김태형: 자이로스윙같이 무서운 건 나만 믿어 그럼 하나도 안 무서울걸?\n")
            
            if '아니' in answer19:
                print("김태형: 놀이공원은 별로야..? 그럼 다른 곳 갈까? 혹시 나랑 노는 게 싫은 건 아니지?!\n")
                print("김태형님의 당신을 향한 호감지수가 하락중입니다.")

            else:
                print("김태형: ", name4 , "내가 너 남자친구 해도 돼?\n")
                print("김태형님의 당신을 향한 호감지수가 급상승했습니다!")
                
print()
print("--------------------------------------------------------------------------------")
print()


print("당신의 운명의 상대는 과연 누구?")
like=input("당신에게 호감지수가 급상승하거나 상승중인 F4중 한 명의 이름만을 입력하세요!")

if like == '변백현':
    print("당신의 운명의 상대는 변백현님입니다!")
    
elif like == '강동원':
    print("당신의 운명의 상대는 강동원님입니다!")
    
elif like == '차은우':
    print("당신의 운명의 상대는 차은우님입니다!")
    
else:
    print("당신의 운명의 상대는 김태형님입니다!")

